Case_0/CFD/0/ddtVoidfraction
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      ddtVoidfraction;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
1300
(
2.80763e-15
1.37327e-14
5.41287e-14
-0.000501609
-0.0095869
-0.0298208
-0.0675575
-0.116539
...
)
;

boundaryField
{
    wall_bottom
    {
        type            calculated;
        value           uniform 0;
    }
    wall_top
    {
        type            zeroGradient;
    }
    front1
    {
        type            cyclic;
    }
    back1
    {
        type            cyclic;
    }
    left1
    {
        type            cyclic;
    }
    right1
    {
        type            cyclic;
    }
    front2
    {
        type            cyclic;
    }
    back2
    {
        type            cyclic;
    }
    left2
    {
        type            cyclic;
    }
    right2
    {
        type            cyclic;
    }
}


// ************************************************************************* //
